# Python Intro - Final Exercise

In [2]:
import pyodbc
import pandas as pd
import numpy as np

In [3]:
### In windows, Using a ODBC DNS (predefined connection name)
import pyodbc
conn = pyodbc.connect ("DSN=College;"
                      "Server=DESKTOP-AAGNMGA\SQLEXPRESS;"
                      "Database=College;"
                      "Trusted_Connection=yes;")

In [4]:
### Get the students table
students = pd.read_sql("SELECT * FROM Students;",conn)
students.head()

   StudentId FirstName   LastName Gender
0      162.0    Elmira    Holston      F
1      154.0    Sierra  Van Vorst      F
2       28.0     Mycah    Bingham      F
3       54.0      Alia      Jones      F
4       31.0    Chanda   Fillmore      F

In [5]:
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head()

   DepartmentId DepartmentName
0           1.0        English
1           2.0        Science
2           3.0           Arts
3           4.0          Sport

In [6]:
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head()

   CourseId            CourseName  DepartmentId  TeacherId
0       1.0     English Begginers           1.0       15.0
1       2.0      Advanced English           1.0       15.0
2       3.0  Proffesional English           1.0       15.0
3       4.0       Mathematics 101           2.0        2.0
4       5.0   Matematics Advanced           2.0       13.0

In [7]:
classrooms = pd.read_sql("SELECT * FROM Classrooms;",conn)
classrooms.head()

   CourseId  StudentId     degree
0       1.0      202.0  92.031070
1       1.0       12.0  81.175916
2       1.0      232.0  82.396587
3       1.0      123.0  62.420449
4       1.0      274.0  72.569900

# Questions
 
 
## Q1. Count the number of students on each department

In [8]:
Q1 = classrooms.merge(courses, on = 'CourseId').merge(departments, on='DepartmentId')
Q1.head()

,CourseId,StudentId,degree,CourseName,DepartmentId,TeacherId,DepartmentName
0,1.0,202.0,92.031070,English Begginers,1.0,15.0,English
1,1.0,12.0,81.175916,English Begginers,1.0,15.0,English
2,1.0,232.0,82.396587,English Begginers,1.0,15.0,English
3,1.0,123.0,62.420449,English Begginers,1.0,15.0,English
4,1.0,274.0,72.569900,English Begginers,1.0,15.0,English

In [9]:
Q1.groupby('DepartmentName').agg({'StudentId':pd.Series.nunique})

                StudentId
DepartmentName
Arts                137.0
English              84.0
Science             200.0
Sport                81.0

## Q2. How many students have each course of the English department and the total number of students in the department?

In [10]:
Q1[(Q1.DepartmentId.isin([1]))].\
    groupby('CourseName').\
    agg({'StudentId':pd.Series.nunique})

                      StudentId
CourseName
Advanced English           24.0
English Begginers          32.0
Proffesional English       38.0

In [11]:
Q1[(Q1.DepartmentId.isin([1]))].\ 
    groupby('DepartmentName').\
    agg({'StudentId':pd.Series.nunique})

                StudentId
DepartmentName
English              84.0

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

In [82]:
Q1['StudentCnt'] = Q1[(Q1.CourseId.isin([4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19]))].\
    groupby(['DepartmentName','CourseName']).\
    agg({'StudentId':pd.Series.nunique})

TypeError: incompatible index of inserted column with frame index

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

## Q5. For which courses the percentage of male/female students is over 70%?

## Q6. For each department, how many students passed with a grades over 80?

## Q7. For each department, how many students passed with a grades under 60?

## Q8. Rate the teachers by their average student's grades (in descending order).

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).